app/Controllers/LoteController.php

    public function visualizacionLotes() {

        $loteModel = new LoteModel();
        $data['lotes'] = $loteModel->findAll();
---
SELECT *
FROM `lotes`