app/Models/ReportesModel.php

SELECT *
FROM `reportes`
ORDER BY `fechaAlimentacion` ASC
---
    public function obtenerReportes()
    {
        return $this->orderBy('fechaAlimentacion', 'ASC')->findAll();